// Фильтрация

// функция фильтр

// inBetween(a, b) - между a и b (включительно)
// inArray([...]) - находится в данном массиве

// Как будут использоваться:

// arr.filter(inBetween(3, 6)) - выбирает только значение между 3 и 6 (включительно)
// arr.filter(inArray([1,2,3])) - выбирает только элементы, совпадающие с одним из эллементов массива

// .... ваш код

// let arr = [1, 2, 3, 4, 5, 6, 7];

//console.log(arr.filter(inBetween(3,6))); // 3,4,5,6
// console.log(arr.filter(inArray([1,2,10]))); // 1,2
console.log(11); // 1,2